IRP/src/Documents/JournalEntry/JournalEntry.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>JournalEntry</name>
 <posting>Deny</posting>
 <registerRecords>AccountingRegister.Basic</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>LedgerType</name>
  <type>
   <types>CatalogRef.LedgerTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Basis</name>
  <type>
   <types>DefinedType.typeAccountingDocuments</types>
  </type>
 </attributes>
 <attributes>
  <name>UserDefined</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ELedgerRegistry</name>
  <type>
   <types>DocumentRef.ELedgerRegistry</types>
  </type>
 </attributes>
 <attributes>
  <name>SequentalNumber</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>12</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Errors</name>
  <attributes>
   <name>Error</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>1024</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/InformationRegisters/T9050S_AccountingRowAnalytics/T9050S_AccountingRowAnalytics.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9050S_AccountingRowAnalytics</name>
 <dimensions>
  <name>Document</name>
  <type>
   <types>DefinedType.typeAccountingDocuments</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Key</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Operation</name>
  <type>
   <types>CatalogRef.AccountingOperations</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LedgerType</name>
  <type>
   <types>CatalogRef.LedgerTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>AccountDebit</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </dimensions>
 <dimensions>
  <name>AccountCredit</name>
  <type>
   <types>ChartOfAccountsRef.Basic</types>
  </type>
 </dimensions>
 <dimensions>
  <name>IsFixed</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>UUID</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/T9051S_AccountingExtDimensions/T9051S_AccountingExtDimensions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>T9051S_AccountingExtDimensions</name>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DefinedType.typeAccountingDocuments</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Key</name>
    <type>
      <types>DefinedType.typeRowID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Operation</name>
    <type>
      <types>CatalogRef.AccountingOperations</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LedgerType</name>
    <type>
      <types>CatalogRef.LedgerTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AnalyticType</name>
    <type>
      <types>EnumRef.AccountingAnalyticTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ExtDimensionType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.AccountingExtraDimensionTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ExtDimension</name>
    <type>
      <types>Characteristic.AccountingExtraDimensionTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>UUID</name>
    <type>
      <types>DefinedType.typeRowID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/AccountingRegisters/Basic/Basic.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
 <name>Basic</name>
 <chartOfAccounts>ChartOfAccounts.Basic</chartOfAccounts>
 <correspondence>true</correspondence>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
  <balance>true</balance>
 </dimensions>
 <dimensions>
  <name>LedgerType</name>
  <type>
   <types>CatalogRef.LedgerTypes</types>
  </type>
  <balance>true</balance>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
  <balance>true</balance>
  <extDimensionAccountingFlag>ChartOfAccounts.Basic.ExtDimensionAccountingFlag.Amount</extDimensionAccountingFlag>
 </resources>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
  <accountingFlag>ChartOfAccounts.Basic.AccountingFlag.Quantity</accountingFlag>
  <extDimensionAccountingFlag>ChartOfAccounts.Basic.ExtDimensionAccountingFlag.Quantity</extDimensionAccountingFlag>
 </resources>
 <resources>
  <name>CurrencyAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
  <accountingFlag>ChartOfAccounts.Basic.AccountingFlag.Currency</accountingFlag>
  <extDimensionAccountingFlag>ChartOfAccounts.Basic.ExtDimensionAccountingFlag.Currency</extDimensionAccountingFlag>
 </resources>
 <attributes>
  <name>Operation</name>
  <type>
   <types>CatalogRef.AccountingOperations</types>
  </type>
 </attributes>
 <attributes>
  <name>IsFixed</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>IsByRow</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Key</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </attributes>
</mdclass:AccountingRegister>

IRP/src/Documents/JournalEntry/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If CommonFunctionsClientServer.GetFromAddInfo(ThisObject.AdditionalProperties, "SetELedger", False) Then
		Return;
	EndIf;
	
	If ValueIsFilled(ThisObject.Basis) Then
		ThisObject.Date = ThisObject.Basis.Date;
		If CommonFunctionsClientServer.ObjectHasProperty(ThisObject.Basis, "Branch") Then
			ThisObject.Branch = ThisObject.Basis.Branch;
		EndIf;		
	EndIf;
	
	For Each Row In ThisObject.RegisterRecords.Basic Do 
		Row.Period = ThisObject.Date;
	EndDo;
	
	If Not ThisObject.DeletionMark And Not ThisObject.UserDefined Then
		ThisObject.RegisterRecords.Basic.Clear();
			
		RecordSet = InformationRegisters.T9050S_AccountingRowAnalytics.CreateRecordSet();
		RecordSet.Filter.Document.Set(ThisObject.Basis);
		RecordSet.Filter.LedgerType.Set(ThisObject.LedgerType);
		RecordSet.Read();
		_AccountingRowAnalytics = RecordSet.Unload();
		
		AccountingServer.SortAccountingAnalyticRows(_AccountingRowAnalytics, ThisObject.Basis);
				
		RecordSet = InformationRegisters.T9051S_AccountingExtDimensions.CreateRecordSet();
		RecordSet.Filter.Document.Set(ThisObject.Basis);
		RecordSet.Filter.LedgerType.Set(ThisObject.LedgerType);
		RecordSet.Read();
		_AccountingExtDimensions = RecordSet.Unload();
			
		Result = AccountingServer.GetNewDataRegisterRecords(ThisObject.Basis, _AccountingRowAnalytics, _AccountingExtDimensions);
		DataTable = Result.DataTable;
			
		ThisObject.Errors.Clear();
		For Each Error In Result.Errors Do
			NewError = ThisObject.Errors.Add();
			NewError.Error = Error;
		EndDo;
					
		AccountingServer.SetDataRegisterRecords(DataTable, ThisObject.LedgerType, ThisObject.RegisterRecords.Basic);
	EndIf;
	
	ThisObject.DocumentAmount = ThisObject.RegisterRecords.Basic.Unload().Total("Amount");
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If CommonFunctionsClientServer.GetFromAddInfo(ThisObject.AdditionalProperties, "SetELedger", False) Then
		Return;
	EndIf;
	
	WriteOnForm = CommonFunctionsClientServer.GetFromAddInfo(ThisObject.AdditionalProperties, "WriteOnForm", False);
	
	If Not WriteOnForm Then
		ThisObject.RegisterRecords.Basic.Read();
	EndIf;
	
	RecordsTable = ThisObject.RegisterRecords.Basic.Unload();
	RecordsTable.Columns.Add("Order");
	For Each Row In RecordsTable Do
		Row.Order = Row.Operation.Order;
	EndDo;
	RecordsTable.Sort("Order");
	ThisObject.RegisterRecords.Basic.Load(RecordsTable);
			
	For Each Record In ThisObject.RegisterRecords.Basic Do
		Record.Company = ThisObject.Company;
		Record.LedgerType = ThisObject.LedgerType;
	EndDo;
	
	ThisObject.RegisterRecords.Basic.SetActive(Not ThisObject.DeletionMark);
	ThisObject.RegisterRecords.Basic.Write();
	
	If ValueIsFilled(ThisObject.Basis) Then
		Action = ?(ThisObject.DeletionMark Or Not ThisObject.Basis.Posted, "CancelProcessed", "Processed");
		AccountingServer.UpdateAccountingRelevance(ThisObject.Basis, Action, ThisObject.LedgerType, ThisObject.Errors.Count());
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If TypeOf(FillingData) = Type("Structure") Then
		If FillingData.Property("Basis") Then
			ThisObject.Basis      = FillingData.Basis;
			If CommonFunctionsClientServer.ObjectHasProperty(FillingData.Basis, "Company") Then
				ThisObject.Company = FillingData.Basis.Company;
			EndIf;
		EndIf;
		
		If FillingData.Property("LedgerType") Then
			ThisObject.LedgerType = FillingData.LedgerType;
		EndIf;
	EndIf;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	SetObjectAndFormAttributeConformity(ThisObject, "Object");
	
	If Not ThisObject.UserDefined Then
		CheckedAttributes.Add("Basis");
	EndIf;
	
	Index = 0;
	For Each Row In ThisObject.RegisterRecords.Basic Do 
		If Not ValueIsFilled(Row.AccountDr) Then
			If Not (ValueIsFilled(Row.AccountCr) And Row.AccountCr.OffBalance) Then
				Cancel = True;
				CommonFunctionsClientServer.ShowUsersMessage(
					R().AccountingError_02, "RegisterRecords.Basic["+ Index +"].AccountDr", ThisObject);
			EndIf;
		Else
			If Row.AccountDr.NotUsedForRecords Then
				Cancel = True;
				CommonFunctionsClientServer.ShowUsersMessage(
					StrTemplate(R().AccountingError_01, Row.AccountDr), "RegisterRecords.Basic["+ Index +"].AccountDr", ThisObject);
			EndIf;
		EndIf;
		
		If Not ValueIsFilled(Row.AccountCr) Then
			If Not (ValueIsFilled(Row.AccountDr) And Row.AccountDr.OffBalance) Then
				Cancel = True;
				CommonFunctionsClientServer.ShowUsersMessage(
					R().AccountingError_03, "RegisterRecords.Basic["+ Index +"].AccountCr", ThisObject);
			EndIf;
		Else
			If Row.AccountCr.NotUsedForRecords Then
				Cancel = True;
				CommonFunctionsClientServer.ShowUsersMessage(
					StrTemplate(R().AccountingError_01, Row.AccountCr), "RegisterRecords.Basic["+ Index +"].AccountCr", ThisObject);
			EndIf;
		EndIf;
		
		Index = Index + 1;
	EndDo;
	
EndProcedure
